---
kind: type
id: T:Autodesk.Revit.DB.PointOnCurveMeasurementType
source: html/8bd00c68-1bcd-9bc9-c246-0f0c96962146.htm
---
# Autodesk.Revit.DB.PointOnCurveMeasurementType

Point on curve measurement type
 Defines the types of measurements that may be used when placing a point at a designated distance along a curve.

## Syntax (C#)
```csharp
public enum PointOnCurveMeasurementType
```